In [98]:
import pandas as pd

In [99]:
df = pd.read_csv('DataClean.csv')

In [100]:
print(df)

          Status Age Group    Education    Industry   Location   AI Risk  \
0       EMPLOYED     25_34  high school  Technology      Urban       NaN
1       EMPLOYED     18-24      Diploma     Fintech      rural  moderate
2       EMPLOYED     25_34  High School      Retail      Delhi       Low
3     UNEMPLOYED     18-24      Masters      Retail      Urban       Low
4            NaN     45-54      Diploma     Fintech  Hyderabad       low
...          ...       ...          ...         ...        ...       ...
1995    employed     25-34         Ph.D     Finance  Hyderabad       Low
1996    EMPLOYED     25-34          PhD       Tech         NaN       NaN
1997         NaN   35 - 44      Masters   Education        NaN       low
1998    EMPLOYED     25_34  high school      Retail     Mumbai      HIGH
1999  UNEMPLOYED     25_34  High School         NaN        NaN  moderate

      Years of Experience  Monthly Salary (INR) Date Recorded
0                     NaN               40700.0    01-01-2023
1                     NaN               17500.0    01-02-2023
2                    16.0               77600.0    01-03-2023
3                    30.0              100200.0    01-04-2023
4                     9.0               19500.0    01-05-2023
...                   ...                   ...           ...
1995                  NaN              113000.0     6/18/2028
1996                 22.0              102200.0     6/19/2028
1997                  NaN               31600.0     6/20/2028
1998                 22.0               92500.0     6/21/2028
1999                  NaN               43300.0     6/22/2028

[2000 rows x 9 columns]

In [101]:
df.columns.str.lower()

Index(['status', 'age group', 'education', 'industry', 'location', 'ai risk',
       'years of experience', 'monthly salary (inr)', 'date recorded'],
      dtype='object')

In [102]:
df.columns.str.replace(' ','_')

Index(['Status', 'Age_Group', 'Education', 'Industry', 'Location', 'AI_Risk',
       'Years_of_Experience', 'Monthly_Salary_(INR)', 'Date_Recorded'],
      dtype='object')

In [103]:
df.columns = df.columns.str.lower().str.replace(' ','_')

In [104]:
print(df.columns)

Index(['status', 'age_group', 'education', 'industry', 'location', 'ai_risk',
       'years_of_experience', 'monthly_salary_(inr)', 'date_recorded'],
      dtype='object')

In [105]:
df['status'] = df['status'].str.lower().str.replace('employed','1').str.replace('un1','0')
df['status']

0         1
1         1
2         1
3         0
4       NaN
       ...
1995      1
1996      1
1997    NaN
1998      1
1999      0
Name: status, Length: 2000, dtype: object

In [106]:
df['age_group'].unique()

array(['25_34', '18-24', '45-54', '35 - 44', '55+', '25-34', '18 to 24',
       nan], dtype=object)

In [107]:
df['age_group'] = df['age_group'].str.replace('_','-').str.replace(' - ','-').str.replace('+','-65').str.replace(' to ','-')
df

,status,age_group,education,industry,location,ai_risk,years_of_experience,monthly_salary_(inr),date_recorded
0,1,25-34,high school,Technology,Urban,NaN,NaN,40700.0,01-01-2023
1,1,18-24,Diploma,Fintech,rural,moderate,NaN,17500.0,01-02-2023
2,1,25-34,High School,Retail,Delhi,Low,16.0,77600.0,01-03-2023
3,0,18-24,Masters,Retail,Urban,Low,30.0,100200.0,01-04-2023
4,NaN,45-54,Diploma,Fintech,Hyderabad,low,9.0,19500.0,01-05-2023
...,...,...,...,...,...,...,...,...,...
1995,1,25-34,Ph.D,Finance,Hyderabad,Low,NaN,113000.0,6/18/2028
1996,1,25-34,PhD,Tech,NaN,NaN,22.0,102200.0,6/19/2028
1997,NaN,35-44,Masters,Education,NaN,low,NaN,31600.0,6/20/2028
1998,1,25-34,high school,Retail,Mumbai,HIGH,22.0,92500.0,6/21/2028
1999,0,25-34,High School,NaN,NaN,moderate,NaN,43300.0,6/22/2028

In [108]:
df['education'].unique()

array(['high school', 'Diploma', 'High School', 'Masters', 'PhD',
       'Master', 'Ph.D', 'Bachelors', nan, "Bachelor's"], dtype=object)

In [109]:
df['education'] = df['education'].str.lower()
df

,status,age_group,education,industry,location,ai_risk,years_of_experience,monthly_salary_(inr),date_recorded
0,1,25-34,high school,Technology,Urban,NaN,NaN,40700.0,01-01-2023
1,1,18-24,diploma,Fintech,rural,moderate,NaN,17500.0,01-02-2023
2,1,25-34,high school,Retail,Delhi,Low,16.0,77600.0,01-03-2023
3,0,18-24,masters,Retail,Urban,Low,30.0,100200.0,01-04-2023
4,NaN,45-54,diploma,Fintech,Hyderabad,low,9.0,19500.0,01-05-2023
...,...,...,...,...,...,...,...,...,...
1995,1,25-34,ph.d,Finance,Hyderabad,Low,NaN,113000.0,6/18/2028
1996,1,25-34,phd,Tech,NaN,NaN,22.0,102200.0,6/19/2028
1997,NaN,35-44,masters,Education,NaN,low,NaN,31600.0,6/20/2028
1998,1,25-34,high school,Retail,Mumbai,HIGH,22.0,92500.0,6/21/2028
1999,0,25-34,high school,NaN,NaN,moderate,NaN,43300.0,6/22/2028

In [110]:
df['education'].unique()

array(['high school', 'diploma', 'masters', 'phd', 'master', 'ph.d',
       'bachelors', nan, "bachelor's"], dtype=object)

In [111]:
df['education'] = df['education'].str.replace(' ','_').str.replace('masters','master').str.replace('.','').str.replace('bachelors','bachelor').str.replace("'s","")
df['education']

0       high_school
1           diploma
2       high_school
3            master
4           diploma
           ...
1995            phd
1996            phd
1997         master
1998    high_school
1999    high_school
Name: education, Length: 2000, dtype: object

In [112]:
df['education'].unique()

array(['high_school', 'diploma', 'master', 'phd', 'bachelor', nan],
      dtype=object)

In [113]:
df['industry'] = df['industry'].str.lower()

In [114]:
df['industry'].unique()

array(['technology', ' fintech', 'retail', 'tech ', nan, 'health',
       'healthcare', 'education', 'finance'], dtype=object)

In [115]:
df['industry'] = df['industry'].str.replace('technology','tech').str.replace('healthcare','health')
df['industry'].unique()

array(['tech', ' fintech', 'retail', 'tech ', nan, 'health', 'education',
       'finance'], dtype=object)

In [116]:
df['location'].unique()

array(['Urban', 'rural', 'Delhi', 'Hyderabad', 'Bangalore', 'Mumbai', nan,
       'urban', 'suburban', 'delhi'], dtype=object)

In [117]:
df['location'] = df['location'].str.lower().str.replace('delhi','urban').str.replace('hyderabad','urban').str.replace('bangalore','urban').str.replace('mumbai','urban')
df['location'].unique()

array(['urban', 'rural', nan, 'suburban'], dtype=object)

In [118]:
df['ai_risk'].unique()

array([nan, 'moderate', 'Low', 'low', 'HIGH', 'Medium', 'High'],
      dtype=object)

In [119]:
df['ai_risk'] = df['ai_risk'].str.lower().str.replace('moderate','medium')
df['ai_risk'].unique()

array([nan, 'medium', 'low', 'high'], dtype=object)

In [120]:
df['years_of_experience'].unique()

array([nan, 16., 30.,  9., 20., 28.,  0.,  3., 18.,  6.,  5., 24., 12.,
       22., 15.,  2.,  8., 25., 10.,  1., 11.,  4., 17.,  7., 27., 26.,
       21., 23., 19., 29., 14., 13.])

In [121]:
df

,status,age_group,education,industry,location,ai_risk,years_of_experience,monthly_salary_(inr),date_recorded
0,1,25-34,high_school,tech,urban,NaN,NaN,40700.0,01-01-2023
1,1,18-24,diploma,fintech,rural,medium,NaN,17500.0,01-02-2023
2,1,25-34,high_school,retail,urban,low,16.0,77600.0,01-03-2023
3,0,18-24,master,retail,urban,low,30.0,100200.0,01-04-2023
4,NaN,45-54,diploma,fintech,urban,low,9.0,19500.0,01-05-2023
...,...,...,...,...,...,...,...,...,...
1995,1,25-34,phd,finance,urban,low,NaN,113000.0,6/18/2028
1996,1,25-34,phd,tech,NaN,NaN,22.0,102200.0,6/19/2028
1997,NaN,35-44,master,education,NaN,low,NaN,31600.0,6/20/2028
1998,1,25-34,high_school,retail,urban,high,22.0,92500.0,6/21/2028
1999,0,25-34,high_school,NaN,NaN,medium,NaN,43300.0,6/22/2028

In [122]:
df.describe()

       years_of_experience  monthly_salary_(inr)
count           980.000000           1613.000000
mean             15.244898          76886.360818
std               9.103941          41628.008054
min               0.000000           5100.000000
25%               7.000000          40700.000000
50%              16.000000          77200.000000
75%              23.000000         112400.000000
max              30.000000         149900.000000

In [123]:
df.describe(include='all')

,status,age_group,education,industry,location,ai_risk,years_of_experience,monthly_salary_(inr),date_recorded
count,1732,1768,1804,1799,1787,1716,980.000000,1613.000000,2000
unique,2,5,5,7,3,3,NaN,NaN,2000
top,1,18-24,bachelor,retail,urban,high,NaN,NaN,01-01-2023
freq,885,518,425,429,1345,596,NaN,NaN,1
mean,NaN,NaN,NaN,NaN,NaN,NaN,15.244898,76886.360818,NaN
std,NaN,NaN,NaN,NaN,NaN,NaN,9.103941,41628.008054,NaN
min,NaN,NaN,NaN,NaN,NaN,NaN,0.000000,5100.000000,NaN
25%,NaN,NaN,NaN,NaN,NaN,NaN,7.000000,40700.000000,NaN
50%,NaN,NaN,NaN,NaN,NaN,NaN,16.000000,77200.000000,NaN
75%,NaN,NaN,NaN,NaN,NaN,NaN,23.000000,112400.000000,NaN
max,NaN,NaN,NaN,NaN,NaN,NaN,30.000000,149900.000000,NaN

In [124]:
df.isnull().sum()

status                   268
age_group                232
education                196
industry                 201
location                 213
ai_risk                  284
years_of_experience     1020
monthly_salary_(inr)     387
date_recorded              0
dtype: int64

In [125]:
df.drop(columns='years_of_experience', inplace=True)
df

,status,age_group,education,industry,location,ai_risk,monthly_salary_(inr),date_recorded
0,1,25-34,high_school,tech,urban,NaN,40700.0,01-01-2023
1,1,18-24,diploma,fintech,rural,medium,17500.0,01-02-2023
2,1,25-34,high_school,retail,urban,low,77600.0,01-03-2023
3,0,18-24,master,retail,urban,low,100200.0,01-04-2023
4,NaN,45-54,diploma,fintech,urban,low,19500.0,01-05-2023
...,...,...,...,...,...,...,...,...
1995,1,25-34,phd,finance,urban,low,113000.0,6/18/2028
1996,1,25-34,phd,tech,NaN,NaN,102200.0,6/19/2028
1997,NaN,35-44,master,education,NaN,low,31600.0,6/20/2028
1998,1,25-34,high_school,retail,urban,high,92500.0,6/21/2028
1999,0,25-34,high_school,NaN,NaN,medium,43300.0,6/22/2028

In [126]:
mode = df['ai_risk'].mode()[0]
df['ai_risk'].fillna(mode, inplace=True)

/var/folders/02/srb2fnrs669c482y2nd5t01w0000gn/T/ipykernel_15600/2142474104.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['ai_risk'].fillna(mode, inplace=True)

In [127]:
mode = df['location'].mode()[0]
df['location'].fillna(mode, inplace=True)

/var/folders/02/srb2fnrs669c482y2nd5t01w0000gn/T/ipykernel_15600/449851067.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['location'].fillna(mode, inplace=True)

In [128]:
df

,status,age_group,education,industry,location,ai_risk,monthly_salary_(inr),date_recorded
0,1,25-34,high_school,tech,urban,high,40700.0,01-01-2023
1,1,18-24,diploma,fintech,rural,medium,17500.0,01-02-2023
2,1,25-34,high_school,retail,urban,low,77600.0,01-03-2023
3,0,18-24,master,retail,urban,low,100200.0,01-04-2023
4,NaN,45-54,diploma,fintech,urban,low,19500.0,01-05-2023
...,...,...,...,...,...,...,...,...
1995,1,25-34,phd,finance,urban,low,113000.0,6/18/2028
1996,1,25-34,phd,tech,urban,high,102200.0,6/19/2028
1997,NaN,35-44,master,education,urban,low,31600.0,6/20/2028
1998,1,25-34,high_school,retail,urban,high,92500.0,6/21/2028
1999,0,25-34,high_school,NaN,urban,medium,43300.0,6/22/2028

In [129]:
df.isnull().sum()

status                  268
age_group               232
education               196
industry                201
location                  0
ai_risk                   0
monthly_salary_(inr)    387
date_recorded             0
dtype: int64

In [130]:
for col in ['status','age_group','education','industry']:
    mode = df[col].mode()[0]
    df[col].fillna(mode, inplace=True)
df

/var/folders/02/srb2fnrs669c482y2nd5t01w0000gn/T/ipykernel_15600/4207067604.py:3: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df[col].fillna(mode, inplace=True)

,status,age_group,education,industry,location,ai_risk,monthly_salary_(inr),date_recorded
0,1,25-34,high_school,tech,urban,high,40700.0,01-01-2023
1,1,18-24,diploma,fintech,rural,medium,17500.0,01-02-2023
2,1,25-34,high_school,retail,urban,low,77600.0,01-03-2023
3,0,18-24,master,retail,urban,low,100200.0,01-04-2023
4,1,45-54,diploma,fintech,urban,low,19500.0,01-05-2023
...,...,...,...,...,...,...,...,...
1995,1,25-34,phd,finance,urban,low,113000.0,6/18/2028
1996,1,25-34,phd,tech,urban,high,102200.0,6/19/2028
1997,1,35-44,master,education,urban,low,31600.0,6/20/2028
1998,1,25-34,high_school,retail,urban,high,92500.0,6/21/2028
1999,0,25-34,high_school,retail,urban,medium,43300.0,6/22/2028

In [131]:
df.isnull().sum()

status                    0
age_group                 0
education                 0
industry                  0
location                  0
ai_risk                   0
monthly_salary_(inr)    387
date_recorded             0
dtype: int64

In [132]:
df.describe()

       monthly_salary_(inr)
count           1613.000000
mean           76886.360818
std            41628.008054
min             5100.000000
25%            40700.000000
50%            77200.000000
75%           112400.000000
max           149900.000000

In [133]:
df['monthly_salary_(inr)'] = df['monthly_salary_(inr)'].clip(lower=40700, upper=112400)

In [134]:
df

,status,age_group,education,industry,location,ai_risk,monthly_salary_(inr),date_recorded
0,1,25-34,high_school,tech,urban,high,40700.0,01-01-2023
1,1,18-24,diploma,fintech,rural,medium,40700.0,01-02-2023
2,1,25-34,high_school,retail,urban,low,77600.0,01-03-2023
3,0,18-24,master,retail,urban,low,100200.0,01-04-2023
4,1,45-54,diploma,fintech,urban,low,40700.0,01-05-2023
...,...,...,...,...,...,...,...,...
1995,1,25-34,phd,finance,urban,low,112400.0,6/18/2028
1996,1,25-34,phd,tech,urban,high,102200.0,6/19/2028
1997,1,35-44,master,education,urban,low,40700.0,6/20/2028
1998,1,25-34,high_school,retail,urban,high,92500.0,6/21/2028
1999,0,25-34,high_school,retail,urban,medium,43300.0,6/22/2028

In [135]:
df.isnull().sum()

status                    0
age_group                 0
education                 0
industry                  0
location                  0
ai_risk                   0
monthly_salary_(inr)    387
date_recorded             0
dtype: int64

In [136]:
df['monthly_salary_(inr)'] = df['monthly_salary_(inr)'].fillna(df.groupby(['education','industry','location'])['monthly_salary_(inr)'].transform('mean'))

In [137]:
df

,status,age_group,education,industry,location,ai_risk,monthly_salary_(inr),date_recorded
0,1,25-34,high_school,tech,urban,high,40700.0,01-01-2023
1,1,18-24,diploma,fintech,rural,medium,40700.0,01-02-2023
2,1,25-34,high_school,retail,urban,low,77600.0,01-03-2023
3,0,18-24,master,retail,urban,low,100200.0,01-04-2023
4,1,45-54,diploma,fintech,urban,low,40700.0,01-05-2023
...,...,...,...,...,...,...,...,...
1995,1,25-34,phd,finance,urban,low,112400.0,6/18/2028
1996,1,25-34,phd,tech,urban,high,102200.0,6/19/2028
1997,1,35-44,master,education,urban,low,40700.0,6/20/2028
1998,1,25-34,high_school,retail,urban,high,92500.0,6/21/2028
1999,0,25-34,high_school,retail,urban,medium,43300.0,6/22/2028

In [138]:
df.isnull().sum()

status                  0
age_group               0
education               0
industry                0
location                0
ai_risk                 0
monthly_salary_(inr)    0
date_recorded           0
dtype: int64

In [139]:
df.describe()

       monthly_salary_(inr)
count           2000.000000
mean           76666.229900
std            26613.281468
min            40700.000000
25%            48475.000000
50%            77200.000000
75%           104250.000000
max           112400.000000

In [140]:
df['date_recorded'] = df['date_recorded'].str.replace('/','-')

In [141]:
df['date_recorded'] = pd.to_datetime(df['date_recorded'])

In [142]:
df

,status,age_group,education,industry,location,ai_risk,monthly_salary_(inr),date_recorded
0,1,25-34,high_school,tech,urban,high,40700.0,2023-01-01
1,1,18-24,diploma,fintech,rural,medium,40700.0,2023-01-02
2,1,25-34,high_school,retail,urban,low,77600.0,2023-01-03
3,0,18-24,master,retail,urban,low,100200.0,2023-01-04
4,1,45-54,diploma,fintech,urban,low,40700.0,2023-01-05
...,...,...,...,...,...,...,...,...
1995,1,25-34,phd,finance,urban,low,112400.0,2028-06-18
1996,1,25-34,phd,tech,urban,high,102200.0,2028-06-19
1997,1,35-44,master,education,urban,low,40700.0,2028-06-20
1998,1,25-34,high_school,retail,urban,high,92500.0,2028-06-21
1999,0,25-34,high_school,retail,urban,medium,43300.0,2028-06-22

In [144]:
df.drop([0],inplace=True)

In [145]:
df

,status,age_group,education,industry,location,ai_risk,monthly_salary_(inr),date_recorded
1,1,18-24,diploma,fintech,rural,medium,40700.0,2023-01-02
2,1,25-34,high_school,retail,urban,low,77600.0,2023-01-03
3,0,18-24,master,retail,urban,low,100200.0,2023-01-04
4,1,45-54,diploma,fintech,urban,low,40700.0,2023-01-05
5,0,25-34,phd,tech,urban,high,54500.0,2023-01-06
...,...,...,...,...,...,...,...,...
1995,1,25-34,phd,finance,urban,low,112400.0,2028-06-18
1996,1,25-34,phd,tech,urban,high,102200.0,2028-06-19
1997,1,35-44,master,education,urban,low,40700.0,2028-06-20
1998,1,25-34,high_school,retail,urban,high,92500.0,2028-06-21
1999,0,25-34,high_school,retail,urban,medium,43300.0,2028-06-22

In [ ]:
df['date_recorded'] = pd.to_datetime(df['date_recorded'])

In [147]:
df

,status,age_group,education,industry,location,ai_risk,monthly_salary_(inr),date_recorded
1,1,18-24,diploma,fintech,rural,medium,40700.0,2023-01-02
2,1,25-34,high_school,retail,urban,low,77600.0,2023-01-03
3,0,18-24,master,retail,urban,low,100200.0,2023-01-04
4,1,45-54,diploma,fintech,urban,low,40700.0,2023-01-05
5,0,25-34,phd,tech,urban,high,54500.0,2023-01-06
...,...,...,...,...,...,...,...,...
1995,1,25-34,phd,finance,urban,low,112400.0,2028-06-18
1996,1,25-34,phd,tech,urban,high,102200.0,2028-06-19
1997,1,35-44,master,education,urban,low,40700.0,2028-06-20
1998,1,25-34,high_school,retail,urban,high,92500.0,2028-06-21
1999,0,25-34,high_school,retail,urban,medium,43300.0,2028-06-22